---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.Meganewtons
source: html/2a7fcc51-31a9-09ab-ee58-8c95220960d0.htm
---
# Autodesk.Revit.DB.UnitTypeId.Meganewtons Property

Meganewtons.

## Syntax (C#)
```csharp
public static ForgeTypeId Meganewtons { get; }
```